import os
import threading
import time

MENU = [
    ["[2204-00] Образец 2204", "asm2204/st00/main.py"],
    # ["[2204-09] Власов", "asm2204/st06/main.py"],
    # ["[2204-17] Латыпов", "asm2204/st17/main.py"],
    # ["[2204-08] Довиденков", "asm2204/st08/main.py"],
    #["[2204-09] Дудченко", "asm2204/st09/main.py"],
    # ["[2204-21] Мельников", "asm2204/st21/main.py"],
    # ["[2204-11] Ильин", "asm2204/st11/main.py"],
    ["[2205-00] Образец 2205", "asm2205/st00/main.py"],
    ["[2207-00] Образец 2207", "aam2207/st00/main.py"],
    #["[2204-27] Чашников 2204", "asm2204/st27/main.py"],
    # ["[2204-00] Рыбина 2204", "asm2204/st23/main.py"],
    #  ["[2205-06] Емельянова", "asm2205/st06/main.py"],
    #["[2204-25] Селезнев", "asm2204/st25/main.py"],
    #["[2205-23] Хайрутдинов", "asm2205/st23/main.py"],
    #["[2205-25] Харисова", "asm2205/st25/main.py"],
    #["[2205-12] Красин", "asm2205/st12/main.py"],
    #["[2204-15] Крутов 2204", "asm2204/st15/main.py"],
    #["[2204-26] Хаирзаманов 2204", "asm2204/st26/app.py"],
    #["[2204-16] Кунаккулов", "asm2204/st16/main.py"],
    #["[2204-24] Саломатин", "asm2204/st24/main.py"],
    #["[2204-05] Большаков", "asm2204/st05/main.py"],
    #["[2207-26] Юхацков", "aam2207/st26/main.py"],
    #["[2205-16] Матвеев", "asm2205/st16/main.py"],
    #["[2204-18] Листунова", "asm2204/st18/main.py"],
    #["[2205-07] Изранцева", "asm2205/st07/main.py"],
    #["[2207-01] Бацуев", "aam2207/st01/main.py"],
    #["[2204-13] Киселев", "asm2204/st13/main.py"],
    #["[2205-09] Каримова", "asm2205/st09/main.py"],
    #["[2207-07] Докучаева", "aam2207/st07/main.py"],
    #["[2207-10] Куликов", "aam2207/st10/main.py"],
    #["[2205-22] Умедова", "asm2205/st22/main.py"],
    #["[2207-13] Маценко", "aam2207/st13/main.py"],
    #["[2207-03] Булатова", "aam2207/st03/main.py"],
    #["[2205-15] Мамчич", "asm2205/st15/main.py"],
    #["[2207-20] Тавровский", "aam2207/st20/main.py"],
    #["[2205-02] Бухалова", "asm2205/st02/main.py"],
    #["[2207-19] Старцев ", "aam2207/st19/main.py"],
    #["[2207-14] Мицкевич ", "aam2207/st14/main.py"],
    #["[2207-08] Инякова ", "aam2207/st08/main.py"],
    #["[2207-15] Мишина ", "aam2207/st15/main.py"],
    ["[2204-20] Ляскин", "asm2204/st20/main.py"],
    #["[2207-16] Мордашов", "aam2207/st16/main.py"],
    #["[2207-02] Баяндина", "aam2207/st02/main.py"],
    #["[2204-25] Дмитриев", "asm2204/st07/main.py"],
    ###["[2205-24] Халявина", "asm2205/st24/main.py"],
    #["[2204-12] Камашев", "asm2204/st12/main.py"],
    #["[2205-26] Шайхутдинова", "asm2205/st26/main.py"],
    #["[2205-03] Ветюгов", "asm2205/st03/main.py"],
    #["[2207-05] Горелько", "aam2207/st05/main.py"],
    ["[2204-22] Поляков", "asm2204/st22/main.py"],
    #["[2207-17] Овечкин", "aam2207/st17/main.py"],
    #["[2207-25] Шашков", "aam2207/st25/main.py"],
    #["[2205-19] Реутова", "asm2205/st19/main.py"],
    #["[2204-04] Афанасьев", "asm2204/st04/web_flas.py"],
    ###["[2207-24] Черных", "aam2207/st24/main.py"],
    #["[2205-08] Иллуев", "asm2205/st08/main.py"],
    #["[2204-03] АфанасьевД", "asm2204/st03/main.py"],
    #["[2204-14] Константинова", "asm2204/st14/main.py"],
    #["[2205-21] Сулейманов", "asm2205/st21/main.py"],
    #["[2205-20] Смирнова", "asm2205/st20/main.py"],
    #["[2207-11] Куренков", "aam2207/st11/main.py"],



    #		добавить пункт меню для вызова своей главной функции по шаблону:
    #		["[<код группы>-<номер по журналу>] <Фамилия>", "<путь до модуля>"],
]


def launcher():
    time.sleep(3)
    os.system("start http://localhost:5000/")


def menu():
    print("------------------------------")
    for i, item in enumerate(sorted(MENU)):
        print("{0:2}. {1}".format(i, item[0]))
    print("------------------------------")
    return int(input())


try:
    while True:
        try:
            app = sorted(MENU)[menu()][1]
            threading.Thread(target=launcher).start()
            if os.system("python3 " + app):
                os.system("python " + app)
        except KeyboardInterrupt:
            pass
except Exception as ex:
    print(ex, "\nbye")
